Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/hours_of_work/night_work.html.txt.tmx
Source language: en
Languages: ga

source: The working hours of night workers are regulated by the Organisation of Working Time Act 1997
ga: Is faoin Acht um Eagrú Ama Oibre, 1997 a rialaítear uaireanta oibre oibrithe oíche

source: It is important to be clear about what is meant by night work and night worker
ga: Tá sé tábhachtach go dtuigfí go soiléir cad is brí le hobair oíche agus le hoibrí oíche

source: Night work means work done in the period between midnight and 7am
ga: Is éard is brí le hobair oíche ná aon obair a dhéantar idir meán oíche agus 7.00 ar maidin

source: A night worker is an employee who normally works at least 3 hours between midnight and 7am and who works at night for at least half of their working hours in a year
ga: Is ionann oibrí oíche agus oibrí a oibríonn ar feadh 3 uaire idir meán oíche agus 7.00 ar maidin de ghnáth, agus gur san oíche a oibríonn sé/sí leath dá (h)uaireanta oibre i rith na bliana

source: Night workers' hours of work
ga: Uaireanta oibre oibrithe oíche

source: In general the maximum average working week is 48 hours
ga: De ghnáth is é 48 uair an chloig an seachtain oibre uasta ar an meán

source: Normally, a night worker should not work more than an average of 8 hours in a 24-hour period
ga: Ní cóir go n-oibreodh oibrí oíche ar feadh tréimhse níos faide ná 8 n-uaire ar an meán i dtréimhse 24 uair an chloig

source: The average is calculated over either a 2-month period or a longer period if it is part of a collective agreement
ga: Déantar an meán a áireamh thar tréimhse 2 mhí nó thar tréimhse níos faide más cuid de chomhaontú comhchoiteann é

source: If the night work involves special hazards or physical or mental strain, then working hours cannot exceed 8 hours in a 24-hour period
ga: Ní féidir leis na huaireanta oibre a bheith níos faide ná 8 n-uaire in aon tréimhse 24 uair an chloig má bhaineann guaiseacha faoi leith nó strus fisiceach nó intinne leis an obair

source: The employer is required to carry out a risk assessment in order to determine whether the night work involves special hazards, or physical or mental strain
ga: Ní mór don fhostóir measúnú riosca a dhéanamh le fáil amach an mbaineann guaiseacha faoi leith nó strus fisiceach nó intinne leis an obair oíche

source: Pay rates and leave for night workers are not covered by the Organisation of Working Time Act
ga: Ní chlúdaíonn an tAcht um Eagrú Ama Oibre na rátaí pá ná saoire d'oibrithe oíche

source: These depend on the terms of the night worker's contract of employment
ga: Braitheann siad sin ar chonradh fostaíochta an oibrí oíche

source: In general the law regulating the working hours of young people does not permit young people to do night work
ga: De ghnáth ní cheadaíonn an dlí maidir le huaireanta oibre daoine óga go ndéanfadh daoine óga obair oíche

source: Part 6 of the Safety, Health and Welfare (General Application) Regulations 2007 states the steps an employer must take to ensure the health and safety of night workers
ga: Tá cur síos i gCuid 6 de na Rialacháin um Shábháilteacht, Sláinte agus Leas ag an Obair (Feidhm Ghinearálta) 2007 ar na céimeanna a chaithfidh fostóir a ghlacadh chun sláinte agus sábháilteacht oibrithe oíche a chosaint

source: Before employing a person to do night work and at regular intervals while an employee is a night worker, an employer is required to make available an assessment of the effects, if any, on the health of the employee
ga: Ba chóir don fhostóir measúnú a chur ar fáil sula bhfostaítear duine mar oibrí oíche faoi cibé tionchar, más ann dó, a bheadh ag obair oíche ar shláinte an té sin agus a leithéid de mheasúnú a chur ar fáil ag tréimhsí rialta fad is atá an té sin ina oibrí oíche

source: This assessment must be made available, free of charge, to the employee
ga: Ní mór an measúnú seo a chur ar fáil saor in aisce don fhostaí

source: Alternatively, if the employee is entitled to have the assessment carried out by the State free of charge, the employer must make arrangements to allow the employee to access this entitlement
ga: Nó má tá an fostaí i dteideal go ndéanfadh an Stát an measúnú seo saor in aisce, ba chóir don fhostóir socruithe a dhéanamh chun go mbeidh an fostaí in ann an teidlíocht seo a fháil

source: If a night worker becomes ill as a result of night work, the employer should, whenever possible, assign duties to the employee that do not involve night work and which are suited to that employee
ga: Má tharlaíonn sé go mbíonn oibrí oíche breoite de bharr obair oíche, ba chóir don fhostóir, más féidir é ar chor ar bith, obair a thabhairt don fhostaí sin a oireann dó nó di agus nach gá a dhéanamh san oíche

source: If an employee is pregnant and a quarter of her working hours are night work, she may exempted from doing night work if a doctor certifies it may affect her health and safety and that of her baby
ga: Má tá fostaí ag iompar clainne, agus más obair oíche an ceathrú cuid dá huaireanta oibre, féadfaidh sí díolúine a fhail ón obair oíche a dhéanamh má thugann dochtúir teastas di ag rá go bhféadfadh tionchar a bheith ag an obair sin ar shláinte agus ar shábháilteacht na máthar agus an linbh

source: If there is no suitable alternative work she may be given health and safety leave
ga: Murar féidir aon obair eile a thabhairt di féadfar saoire sláinte agus sábháilteachta a thabhairt di

source: This also applies for up to 14 weeks after the birth of her child
ga: Tá feidhm leis seo freisin suas le tréimhse 14 sheachtaine i ndiaidh bhreith a linbh

source: Disputes under the Organisation of Working Time Act 1997 or the Maternity Protection Acts should be referred by making a complaint within 6 months of the dispute occurring
ga: Ba chóir díospóidí faoin Acht um Eagrú Ama Oibre 1997 nó faoi na hAchtanna um Chosaint Mháithreachais a chur laistigh de 6 mhí ón am a tharla an díospóid

source: You must use the online complaint form available on workplacerelations.ie
ga: Caithfidh tú an fhoirm ghearáin ar líne nua a úsáid á fáil ar workplacerelations.ie

source: However this time limit may be extended for up to 12 months if there was reasonable cause for not bringing the complaint within the first 6 months
ga: Is féidir síneadh ama 6 mhí eile a thabhairt duit má bhí fáth réasúnta ann gan an gearán a dhéanamh le linn na chéad 6 mhí

source: The Health and Safety Authority has published a booklet, Guidance for Employers and Employees on Night and Shift Work (pdf)
ga: D’fhoilsigh an tÚdarás Sláinte agus Sábháilteachta bileog, Guidance for Employers and Employees on Night and Shift Work (pdf)

source: Further information on night work and your employment rights is available from the Workplace Relations Commission's Information and Customer Service – see 'Where to apply' below. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Is féidir tuilleadh eolais faoi obair oíche agus faoi chearta fostaíochta a fháil ón tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre– féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos
